Autodesk.Revit.DB.Electrical.CircuitSequence
Options of circuit sequence for assigning circuit to circuits across panel.
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.CircuitSequence.OddThenEven
Create new circuits odd then even (1,3,5,7,9,11 / 2,4,6,8,10,12).

Autodesk.Revit.DB.Electrical.CircuitSequence.GroupByPhase
Create new circuits group by phase (1,3,5 / 2,4,6 / 7,9,11 / 8,10,12).

Autodesk.Revit.DB.Electrical.CircuitSequence.Numerical
Create new circuits numerically (1,2,3,4,5,6,7,8,9,10,11,12).